{
    "Название курса": "Введение в системы хранения и обработки данных",
    "Course title in English": "Data storage and processing systems: introduction",     
    "Формат" : ["большой", "малый", "семинар"],
    "Описание для студентов": "Дать представление о внутреннем устройстве систем хранения и обработки данных: реляционных и нереляционных СУБД, систем пакетной обработки данных (MapReduce и пр.), сетевых дисков, распределенных файловых систем. Рассказать о типовой архитектуре серверных приложений, использующих системы хранения и обработки данных, на примере реальных приложений.",
    "Пререквизиты": "Очень желательно: знание основных алгоритмов и структур данных (достаточно будет, например, программы данного курса: https://www.coursera.org/specializations/algorithms)\nПросто желательно: базовое знание сетевых протоколов, опыт разработки под linux, базовое знание C++",
    "Результаты обучения": "Предполагается, что после прохождения курса\nобучающиеся смогут рассказать:\n - как устроены популярные хранилища данных на уровне одной машины (грубо говоря, будут знать, что такое WAL, B-деревья, SS-tables и т. п.)\n- каким образом реализуется распределенное хранение (что такое алгоритмы распределенного консенсуса, репликация, партиционирование данных, и пр.)\n- как работают распределенные транзакции\n- каким образом реализуется пакетная обработка данных\nТакже после прохождения курса обучающиеся должны быть в состоянии принимать решения о выборе систем хранения данных, наиболее хорошо соответствующих нуждам своих серверных приложений. Не предполагается, что обучающиеся будут готовы разрабатывать собственное хранилище с нуля (все-таки этот курс — «введение»).",
    "Разделы": ["Хранение данных", "Обработка данных"],
    "Вопросы к экзамену": [
        "Надежность, масштабируемость, удобство эксплуатации",
        "Модели данных. Реляционная модель, языки запросов, графовая модель",
        "Локальные хранилища. WAL, B-деревья, SS-tables, Хэш-индексы, поколоночное хранение"
    ],
    "Обязательная литература" : [ "Книжка 1", "Книжка 2" ],
    "Дополнительная литература" : [],
    "Иные информационные источники": ["Сайт 1"],
    "Разработчик": "Стрелковский Андрей Владимирович, qkrorlqr@yandex-team.ru, ведущий разработчик в Службе разработки сетевого блочного устройства (сетевого диска) Яндекс.Облака."
}